# Pandas 
```
pip install pandas 
pip install --upgrade pandas
```
- Pandas Series
- Pandas DataFrame --> use various ways to initialize it(dtype,columns,index)
- Add a column: using name and list
- shape
- head
- tail
- convert to numpy array --> values
- columns
- to_csv (index = false)
- read_csv
-  drop(columns=[])
-  describe()
-  info()
-  iloc
-  loc
-  Access Particular Columns
-  indexing and slicing --> multirow and col
-  columns.get_loc
-  Fancy indexing
-  Filtering
-  unique
-  sort_values(by,ascending)
-  getdummies 
- groupby --> column name, various functions on grp, iterate
- pivot --> summarize and aggregate data,Grouper
- concat--> give as list, ignore_index,join
- merge--> on,how
- dropna
- fillna
- interpolate
- pip install matplotlib
-

In [1]:
import pandas as pd
import numpy as np

In [4]:
print(pd.__version__)
# pd.DF = pd.DataFrame

2.2.3

In [8]:
l1 = [10,20,30,40,50]
d1 = {'A':20,'B':100,'C':10}

In [15]:
# pds = pd.Series(l1,index = ['A','B','C','D','E'],dtype='f8')
pds = pd.Series(d1)

In [16]:
pds

A     20
B    100
C     10
dtype: int64

In [17]:
type(pds)

pandas.core.series.Series

In [18]:
pds['A']

20

In [34]:
marks = {
    'Phy':[80,98,84,75,92],
    'Chem':[92,96,95,80,72],
    'Maths':[100,88,91,95,80]
}

In [35]:
marks

{'Phy': [80, 98, 84, 75, 92],
 'Chem': [92, 96, 95, 80, 72],
 'Maths': [100, 88, 91, 95, 80]}

In [48]:
df = pd.DataFrame(marks,index=['A','B','C','D','E'])

In [49]:
df

   Phy  Chem  Maths
A   80    92    100
B   98    96     88
C   84    95     91
D   75    80     95
E   92    72     80

In [40]:
df['Phy']

A    80
B    98
C    84
D    75
E    92
Name: Phy, dtype: int64

In [41]:
df.Phy

A    80
B    98
C    84
D    75
E    92
Name: Phy, dtype: int64

In [43]:
na = np.random.randint(50,101,size = (10,3))
na

array([[55, 69, 81],
       [90, 53, 65],
       [66, 77, 69],
       [96, 67, 72],
       [64, 93, 67],
       [81, 89, 91],
       [57, 67, 97],
       [60, 56, 65],
       [82, 73, 57],
       [95, 86, 95]])

In [44]:
df2 = pd.DataFrame(na,columns=['OS','DBMS','CN'],dtype='f8')

In [45]:
df2

     OS  DBMS    CN
0  55.0  69.0  81.0
1  90.0  53.0  65.0
2  66.0  77.0  69.0
3  96.0  67.0  72.0
4  64.0  93.0  67.0
5  81.0  89.0  91.0
6  57.0  67.0  97.0
7  60.0  56.0  65.0
8  82.0  73.0  57.0
9  95.0  86.0  95.0

In [53]:
df2['CA'] = np.random.randint(51,101,size=(10,))

In [54]:
df2

     OS  DBMS    CN  CA
0  55.0  69.0  81.0  68
1  90.0  53.0  65.0  96
2  66.0  77.0  69.0  90
3  96.0  67.0  72.0  62
4  64.0  93.0  67.0  84
5  81.0  89.0  91.0  90
6  57.0  67.0  97.0  94
7  60.0  56.0  65.0  87
8  82.0  73.0  57.0  62
9  95.0  86.0  95.0  68

In [55]:
df2.shape

(10, 4)

In [56]:
df2['CA']

0    68
1    96
2    90
3    62
4    84
5    90
6    94
7    87
8    62
9    68
Name: CA, dtype: int32

In [59]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   OS      10 non-null     float64
 1   DBMS    10 non-null     float64
 2   CN      10 non-null     float64
 3   CA      10 non-null     int32
dtypes: float64(3), int32(1)
memory usage: 412.0 bytes

In [62]:
df2.head(2)

     OS  DBMS    CN  CA
0  55.0  69.0  81.0  68
1  90.0  53.0  65.0  96

In [64]:
df2.tail(3)

     OS  DBMS    CN  CA
7  60.0  56.0  65.0  87
8  82.0  73.0  57.0  62
9  95.0  86.0  95.0  68

In [65]:
df.values

array([[ 80,  92, 100],
       [ 98,  96,  88],
       [ 84,  95,  91],
       [ 75,  80,  95],
       [ 92,  72,  80]], dtype=int64)

In [66]:
df2.columns

Index(['OS', 'DBMS', 'CN', 'CA'], dtype='object')

In [67]:
df.columns

Index(['Phy', 'Chem', 'Maths'], dtype='object')

In [72]:
df.rename(columns={'Phy':'P','Chem':'C','Maths':'M'},inplace=True)

    P   C    M
A  80  92  100
B  98  96   88
C  84  95   91
D  75  80   95
E  92  72   80

In [75]:
df.columns = ['P','C','M']
df

    P   C    M
A  80  92  100
B  98  96   88
C  84  95   91
D  75  80   95
E  92  72   80

In [77]:
df.to_csv("Marks.csv",sep='|')

In [90]:
ndf = pd.read_csv('Marks.csv',sep='|',index_col='Unnamed: 0')

In [91]:
ndf

    P   C    M
A  80  92  100
B  98  96   88
C  84  95   91
D  75  80   95
E  92  72   80

In [92]:
df.to_csv("Marks.csv",sep='|',index = False)

In [93]:
ndf = pd.read_csv("Marks.csv",sep='|')
ndf

    P   C    M
0  80  92  100
1  98  96   88
2  84  95   91
3  75  80   95
4  92  72   80

In [94]:
ndf.index = ['A','B','C','D','E']

In [95]:
ndf

    P   C    M
A  80  92  100
B  98  96   88
C  84  95   91
D  75  80   95
E  92  72   80

In [95]:
df

   Maths  Phy  Chem
A    100   80    92
B     88   98    96
C     91   84    95
D     95   75    80
E     82   92    72

In [96]:
df2

     OS  DBMS    CN  CA
0  55.0  69.0  81.0  68
1  90.0  53.0  65.0  96
2  66.0  77.0  69.0  90
3  96.0  67.0  72.0  62
4  64.0  93.0  67.0  84
5  81.0  89.0  91.0  90
6  57.0  67.0  97.0  94
7  60.0  56.0  65.0  87
8  82.0  73.0  57.0  62
9  95.0  86.0  95.0  68

In [98]:
df2.astype('i8')

   OS  DBMS  CN  CA
0  55    69  81  68
1  90    53  65  96
2  66    77  69  90
3  96    67  72  62
4  64    93  67  84
5  81    89  91  90
6  57    67  97  94
7  60    56  65  87
8  82    73  57  62
9  95    86  95  68

In [99]:
df

    P   C    M
A  80  92  100
B  98  96   88
C  84  95   91
D  75  80   95
E  92  72   80

In [103]:
df.drop(columns=['C'],inplace=True)

In [106]:
df.drop(index=['C','E'])

    P    M
A  80  100
B  98   88
D  75   95

In [107]:
df2

     OS  DBMS    CN  CA
0  55.0  69.0  81.0  68
1  90.0  53.0  65.0  96
2  66.0  77.0  69.0  90
3  96.0  67.0  72.0  62
4  64.0  93.0  67.0  84
5  81.0  89.0  91.0  90
6  57.0  67.0  97.0  94
7  60.0  56.0  65.0  87
8  82.0  73.0  57.0  62
9  95.0  86.0  95.0  68

In [108]:
df2.describe()

              OS       DBMS         CN         CA
count  10.000000  10.000000  10.000000  10.000000
mean   74.600000  73.000000  75.900000  80.100000
std    15.987495  13.408124  14.145671  13.551958
min    55.000000  53.000000  57.000000  62.000000
25%    61.000000  67.000000  65.500000  68.000000
50%    73.500000  71.000000  70.500000  85.500000
75%    88.000000  83.750000  88.500000  90.000000
max    96.000000  93.000000  97.000000  96.000000

In [113]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   OS      10 non-null     float64
 1   DBMS    10 non-null     float64
 2   CN      10 non-null     float64
 3   CA      10 non-null     int32
dtypes: float64(3), int32(1)
memory usage: 412.0 bytes

In [114]:
df2[['CA','DBMS']]

   CA  DBMS
0  68  69.0
1  96  53.0
2  90  77.0
3  62  67.0
4  84  93.0
5  90  89.0
6  94  67.0
7  87  56.0
8  62  73.0
9  68  86.0

In [125]:
df2.iloc[[0,4],[2,3]]

     CN  CA
0  81.0  68
4  67.0  84

In [127]:
df2.iloc[::2,::2]

     OS    CN
0  55.0  81.0
2  66.0  69.0
4  64.0  67.0
6  57.0  97.0
8  82.0  57.0

In [132]:
df.loc['A':'C':2,['P']]

    P
A  80
C  84

In [126]:
df.loc[['A','E'],['Phy','Chem']]

   Phy  Chem
A   80    92
E   92    72

In [127]:
df.loc['A':'D']

   Maths  Phy  Chem
A    100   80    92
B     88   98    96
D     95   75    80

In [129]:
df2.loc[0:4]

     OS  DBMS    CN  CA
0  82.0  89.0  51.0  56
1  70.0  92.0  92.0  78
2  98.0  50.0  69.0  70
3  59.0  65.0  85.0  76
4  52.0  86.0  58.0  85

In [138]:
df.loc[[True,False,False,True,False]]

    P    M
A  80  100
D  75   95

In [148]:
df2['total'] = (df2['OS']+df2['CN']+df2['DBMS']+df2['CA'])/4
df2

     OS  DBMS    CN  CA  total
0  55.0  69.0  81.0  68  68.25
1  90.0  53.0  65.0  96  76.00
2  66.0  77.0  69.0  90  75.50
3  96.0  67.0  72.0  62  74.25
4  64.0  93.0  67.0  84  77.00
5  81.0  89.0  91.0  90  87.75
6  57.0  67.0  97.0  94  78.75
7  60.0  56.0  65.0  87  67.00
8  82.0  73.0  57.0  62  68.50
9  95.0  86.0  95.0  68  86.00

In [156]:
df2[['OS','DBMS']].sum(axis=1)

0    124.0
1    143.0
2    143.0
3    163.0
4    157.0
5    170.0
6    124.0
7    116.0
8    155.0
9    181.0
dtype: float64

In [152]:
df2[df2['OS'] >= 80]

     OS  DBMS    CN  CA  total
1  90.0  53.0  65.0  96  76.00
3  96.0  67.0  72.0  62  74.25
5  81.0  89.0  91.0  90  87.75
8  82.0  73.0  57.0  62  68.50
9  95.0  86.0  95.0  68  86.00

In [139]:
wdf = pd.read_csv('weather_data_cities.csv')

In [140]:
wdf

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [148]:
# wdf[wdf['city'] == 'new york'].mean(numeric_only=True)
wdf[wdf['city'] == 'new york']['temperature'].mean()

32.25

In [151]:
for city in wdf['city'].unique():
    print(city, wdf[wdf['city'] == city]['temperature'].mean())

new york 32.25
mumbai 88.5
paris 47.75

In [161]:
parisdf = wdf[wdf['city'] == 'paris']

In [162]:
parisdf

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [164]:
parisdf[parisdf['temperature'] >= 50]

         day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy

In [169]:
wdf[(wdf['city'] == 'paris') & (wdf['temperature'] >= 50)]

         day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy

In [176]:
df2.apply(lambda x:x**2)

       OS    DBMS      CN    CA
0  6724.0  7921.0  2601.0  3136
1  4900.0  8464.0  8464.0  6084
2  9604.0  2500.0  4761.0  4900
3  3481.0  4225.0  7225.0  5776
4  2704.0  7396.0  3364.0  7225
5  4624.0  7396.0  5476.0  2916
6  4624.0  9801.0  3364.0  7056
7  8836.0  5625.0  6084.0  4761
8  4225.0  3969.0  9801.0  7225
9  2500.0  9216.0  8836.0  7225

In [177]:
df2

     OS  DBMS    CN  CA
0  82.0  89.0  51.0  56
1  70.0  92.0  92.0  78
2  98.0  50.0  69.0  70
3  59.0  65.0  85.0  76
4  52.0  86.0  58.0  85
5  68.0  86.0  74.0  54
6  68.0  99.0  58.0  84
7  94.0  75.0  78.0  69
8  65.0  63.0  99.0  85
9  50.0  96.0  94.0  85

In [178]:
df2.sort_values(by = 'OS',axis=0,ascending=False)

     OS  DBMS    CN  CA
2  98.0  50.0  69.0  70
7  94.0  75.0  78.0  69
0  82.0  89.0  51.0  56
1  70.0  92.0  92.0  78
5  68.0  86.0  74.0  54
6  68.0  99.0  58.0  84
8  65.0  63.0  99.0  85
3  59.0  65.0  85.0  76
4  52.0  86.0  58.0  85
9  50.0  96.0  94.0  85

In [179]:
df2.sort_values(by=5,axis = 1,ascending=False)

   DBMS    CN    OS  CA
0  89.0  51.0  82.0  56
1  92.0  92.0  70.0  78
2  50.0  69.0  98.0  70
3  65.0  85.0  59.0  76
4  86.0  58.0  52.0  85
5  86.0  74.0  68.0  54
6  99.0  58.0  68.0  84
7  75.0  78.0  94.0  69
8  63.0  99.0  65.0  85
9  96.0  94.0  50.0  85

In [182]:
df.sort_values(by='D',axis = 1)

   Phy  Chem  Maths
A   80    92    100
B   98    96     88
D   75    80     95
E   92    72     82

In [183]:
pds = pd.Series(['A','B','C','B','A','B'])

In [184]:
pds

0    A
1    B
2    C
3    B
4    A
5    B
dtype: object

In [185]:
pdd = pd.get_dummies(pds)

In [186]:
pdd

       A      B      C
0   True  False  False
1  False   True  False
2  False  False   True
3  False   True  False
4   True  False  False
5  False   True  False

In [187]:
data = pd.read_csv("weather_data_cities.csv")

In [188]:
data

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [189]:
data.iloc[data['temperature'].argmax()]

day            1/4/2017
city             mumbai
temperature          92
windspeed             5
event              Rain
Name: 7, dtype: object

In [152]:
data[data['temperature'] == data['temperature'].max()]

        day    city  temperature  windspeed event
7  1/4/2017  mumbai           92          5  Rain

In [190]:
gdf = data.groupby(by = 'city')

In [191]:
gdf

In [192]:
for city,group in gdf:
    print(city)
    print(group)
    print()

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [195]:
gdf['temperature'].mean()

city
mumbai      88.50
new york    32.25
paris       47.75
Name: temperature, dtype: float64

In [196]:
data

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [197]:
gdf = data.groupby(by='event')

In [199]:
for event,group in gdf:
    print(event)
    print(group)
    print()

Cloudy
         day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

Fog
        day    city  temperature  windspeed event
5  1/2/2017  mumbai           85         12   Fog
6  1/3/2017  mumbai           87         15   Fog

Rain
        day      city  temperature  windspeed event
0  1/1/2017  new york           32          6  Rain
7  1/4/2017    mumbai           92          5  Rain

Snow
        day      city  temperature  windspeed event
2  1/3/2017  new york           28         12  Snow

Sunny
        day      city  temperature  windspeed  event
1  1/2/2017  new york           36          7  Sunny
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny
8  1/1/2017     paris           45         20  Sunny

In [200]:
gdf['windspeed'].mean()

event
Cloudy    10.333333
Fog       13.500000
Rain       5.500000
Snow      12.000000
Sunny      9.750000
Name: windspeed, dtype: float64

In [202]:
gdf = data.groupby(by = 'event')
gdf['windspeed'].mean()

event
Cloudy    10.333333
Fog       13.500000
Rain       5.500000
Snow      12.000000
Sunny      9.750000
Name: windspeed, dtype: float64

In [165]:
data

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [206]:
pidf = data.pivot(index='city',columns='day',values='temperature')

In [208]:
pidf.max(axis = 1)

city
mumbai      92
new york    36
paris       54
dtype: int64

In [227]:
d1 = {
    'A' : [10,20,30,40],
    'B' : [3,4,5,6]
}
d2 = {
    'A' : [30,40,50,60],
    'C' : [3,4,5,6]
}

In [228]:
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2,index=[0,1,2,5])

In [229]:
df1

    A  B
0  10  3
1  20  4
2  30  5
3  40  6

In [230]:
df2

    A  C
0  30  3
1  40  4
2  50  5
5  60  6

In [221]:
# df3 = pd.concat([df1,df2],ignore_index=True)
# df3 = pd.concat([df1,df2],axis = 1)
# df3 = pd.concat([df1,df2],join='inner')
df3 = pd.concat([df1,df2],join='inner',axis = 1)
df3

    A  B   A  C
0  10  3  30  3
1  20  4  40  4
2  30  5  50  5

In [238]:
mdf3 = pd.merge(df1,df2,on='A',how='outer')
mdf3

    A    B    C
0  10  3.0  NaN
1  20  4.0  NaN
2  30  5.0  3.0
3  40  6.0  4.0
4  50  NaN  5.0
5  60  NaN  6.0

In [236]:
mdf3.count()

A    6
B    4
C    4
dtype: int64

In [239]:
mdf3.dropna()

    A    B    C
2  30  5.0  3.0
3  40  6.0  4.0

In [241]:
mdf3.mean()

A    35.0
B     4.5
C     4.5
dtype: float64

In [243]:
mdf3.fillna(mdf3.mean())

    A    B    C
0  10  3.0  4.5
1  20  4.0  4.5
2  30  5.0  3.0
3  40  6.0  4.0
4  50  4.5  5.0
5  60  4.5  6.0

In [244]:
mdf3.interpolate('linear',limit_direction='both')

    A    B    C
0  10  3.0  3.0
1  20  4.0  3.0
2  30  5.0  3.0
3  40  6.0  4.0
4  50  6.0  5.0
5  60  6.0  6.0

In [196]:
arr = np.array([1,2,3,2,3])
arr.argmax()

2